package movieCollectionManagement;
/*
• Этот класс будет содержать метод main, который:
• Запрашивает у пользователя размер коллекции фильмов.
• Позволяет пользователю вводить информацию о каждом фильме (название, режиссер, длительность) до тех пор,
  пока не будет достигнут размер коллекции или пользователь не решит прекратить ввод.
• После завершения ввода выводит список всех фильмов и среднюю длительность.

▎Пример работы программы

1. Программа запрашивает размер коллекции фильмов, например, 3.
2. Пользователь вводит информацию о каждом фильме:

   • Название: "В поисках Немо"
   • Режиссер: "Эндрю Стэнтон"
   • Длительность: 100

3. Программа добавляет фильм в коллекцию и предлагает ввести следующий фильм.
4. После ввода всех фильмов программа выводит список всех добавленных фильмов и среднюю длительность.
▎
Дополнительные требования

• Программа должна обрабатывать ситуации, когда пользователь пытается добавить больше фильмов, чем позволяет размер коллекции.
• Необходимо учитывать возможность ввода некорректных данных (например, отрицательное значение длительности)
  и выводить соответствующие сообщения об ошибках.
 */
public class Main {
}
