package movieCollectionManagement;
/*
• Этот класс будет управлять коллекцией фильмов и должен содержать:
• Массив объектов типа Movie, который будет хранить фильмы.
• Переменную для отслеживания количества добавленных фильмов.

• Класс должен иметь следующие методы:

• addMovie(Movie movie) — добавляет фильм в коллекцию, если есть свободное место.
• displayMovies() — выводит список всех фильмов в коллекции.
• calculateAverageDuration() — вычисляет среднюю длительность фильмов в коллекции и возвращает ее.
  Если коллекция пуста, метод должен возвращать 0.
 */
public class MovieCollection {
}
