package movieCollectionManagement;
/*
• Этот класс будет представлять фильм и должен содержать следующие поля:
• title (название фильма) — строка.
• director (режиссер) — строка.
• duration (длительность в минутах) — целое число.

• Класс должен иметь:

• Конструктор для инициализации всех полей.
• Методы для получения значений полей (геттеры).
• Метод toString(), который возвращает строковое представление фильма в формате:
  "Название: [название], Режиссер: [режиссер], Длительность: [длительность] мин."
 */
public class Movie {
}
