package libraryManagement;
/*
Класс Library (Библиотека):

   • Поля:
     • books — массив объектов типа Book, который хранит все книги в библиотеке.
       Размер массива должен быть фиксированным и определяться при создании объекта библиотеки.
     • count — целое число, представляющее текущее количество добавленных книг в библиотеку (изначально 0).

   • Методы:

     • Конструктор, принимающий размер массива книг.
     • Метод addBook(Book book), который добавляет новую книгу в массив.
       Если массив заполнен, метод должен выводить сообщение об ошибке.
     • Метод calculateAveragePages(), который вычисляет среднее количество страниц во всех книгах библиотеки.
       Если книг нет, метод должен возвращать 0.
     • Метод displayBooks(), который выводит информацию о всех книгах в библиотеке.
 */
public class Library {

}


